{
    "home": {
        "whoAreWe": "We are an amateur esports organization that strives to bring competitive League of Legends to all skill levels. Started in March of 2017 by a soon-to-be college graduate named Travis Guyer, Risen eSports quickly grew. What started as two leagues of 10 teams each quickly became 4 leagues of varying size - for a total of 72 teams and over 400 players. With more growth on the horizon, Risen eSports continues to work hard to bring quality and fun to the community and players.",
        "leagueData": "Currently Risen is not hosting any TFT or Valorant seasons, but instead hosting shorter team tournaments. Join the discord and stay up to date!",
        "goodies": "At Risen there is plenty going on that extends beyond just the actual games occuring. There is an entire community that has been built. There is the official Risen Twitch channel that shows exciting games every week as well as Risen members independent streams. On top of this Risen creates articles that can help you keep up to date and interested about what is happening. If you want something more personal, head over to our stats page and you will be able to see how you have been doing in our leagues as well as how you and your team match up numerically!"
    },
    "contact": {
        "blurb": "Here is the information you need to get in contact with the appropriate person. Even though email information is provided, you will get a much quicker response by reaching out to any of these people via Discord direct message. Don't be shy! We'll help out to the best of our ability.",
        "people": [
            {
                "title": "President / Chief Technical Officer",
                "name": "Travis Guyer",
                "responsibilities": "Business Inquiries, Technical Inquiries, general knowledge/questions",
                "email": "Risenbusiness@gmail.com",
                "discord": "RSN Travis#6119"
            },
            {
                "title": "Broadcast Manager",
                "name": "Joe \"Randojoe\"",
                "responsibilities": "Stream/Broadcast inquiries, casting inquiries, general questions",
                "email": "Risenbusiness@gmail.com",
                "discord": "Randojoe#6148"
            },
            {
                "title": "Partnership Manager / Event Coordinator / Social Media",
                "name": "Julia \"Focùs\"",
                "responsibilities": "Partnership/sponsorship inquiries, Social media questions, event inquiries",
                "email": "Risenbusiness@gmail.com",
                "discord": "Focùs#0213"
            },
            {
                "title": "Discord Moderation",
                "name": "Brett \"Bestrin\"",
                "responsibilities": "Discord moderation, player behavior issues, general questions",
                "email": "Risenbusiness@gmail.com",
                "discord": "Bestrin#8881"
            },
            {
                "title": "Head of Roster Management",
                "name": "Cole",
                "responsibilities": "Roster issues, player behavior issues, general questions",
                "email": "Risenbusiness@gmail.com",
                "discord": "Cole#0004"
            },
            {
                "title": "Roster Management",
                "name": "Richard \"Kruckow\"",
                "responsibilities": "Roster issues, player behavior issues, general questions",
                "email": "Risenbusiness@gmail.com",
                "discord": "Kruckow#7167"
            }
        ]
    },
    "leagues": {
        "rampage": {
            "prettyName": "Rampage Leagues",
            "ranks": "Silver - Gold",
            "peak": "Gold 1",
            "img": "rampage.png",
            "blurb": "Competitive 5v5 action for players in the Gold/Silver skill range",
            "longBlurb": "Rampage is our league for players in the Silver/Gold skill range. \n\n Rampage is for Summoners that are low-mid elo and want to have fun playing in an organized environment. As a Rampage player, you have nowhere to go but up. Playing in one of these leagues might be the catalyst for your overall improvement in League of Legends!",
            "subLeagues": [
                {
                    "prettyName": "Rampage Open",
                    "ranks":"Silver - Gold",
                    "peak":"Gold 1",
                    "longBlurb": "Open league players can sign up solo or with a duo. The rest of your team is assigned to you by our Roster staff.",
                    "blurb": "Sign up on your own or with a friend and compete with a new team!"
                },
                {
                    "prettyName": "Rampage Premade",
                    "ranks":"Silver - Gold",
                    "peak":"Gold 1",
                    "longBlurb": "Premade teams can sign up with a maximum of 10 players and must go through a play-ins process to make it into the league. No role restrictions, try whatever new and wacky strategies you can come up with to win!",
                    "blurb": "Get a roster of at least 5 players together and compete against other teams in Rampage Premade. Up to 10 players can be on a single team."
                }
            ]
        },
        "unstoppable": {
            "prettyName": "Unstoppable League",
            "ranks": "Gold - Platinum",
            "peak": "Platinum 1",
            "img": "rampage.png",
            "blurb": "Competitive 5v5 action for players in the Platinum skill range",
            "longBlurb": "Unstoppable is our league for players in the Platiunum skill range.\n\n Unstoppable is a relatively new league in Risen Esports. It was created to provide a competitive 5v5 for Platinum players who aren't quite ready to step into the more demanding Dominate Leagues yet. Unstoppable Premade is one of our most popular events.",
            "subLeagues": [
                {
                    "prettyName": "Unstoppable Premade",
                    "ranks":"Silver - Gold",
                    "peak":"Platinum 1",
                    "longBlurb": "Premade teams can sign up with a maximum of 10 players and must go through a play-ins process to make it into the league. No role restrictions, try whatever new and wacky strat you can come up with to win.",
                    "blurb": "Get a roster of at least 5 players together and compete against other teams in Unstoppable Premade. Up to 10 players can be on a single team."
                }
            ]
        },
        "dominate": {
            "prettyName": "Dominate Leagues",
            "ranks": "Platinum - Diamond",
            "peak": "Diamond",
            "img": "dominate.png",
            "blurb": "Competitive 5v5 action for players in the Platinum/Diamond skill range",
            "longBlurb": "Dominate is our league for players in the Platiunum/Diamond skill range.\n\n Whether you’re an open or premade player, you’ll get to interact with an awesome and very active community, and improve alongside your teammates. Many of our past Dominate players have had success climbing in solo queue and say that Risen played a part in them getting better at League of Legends.",
            "subLeagues": [
                {
                    "prettyName": "Dominate Open",
                    "ranks":"Platinum/Diamond 4",
                    "peak":"Diamond 4",
                    "longBlurb": "Open league players can sign up solo or with a duo. The rest of your team is assigned to you by our Roster staff.",
                    "blurb": "Sign up on your own or with a friend and compete with a new team!"
                },
                {
                    "prettyName": "Dominate Premade",
                    "ranks":"Platinum - Diamond",
                    "peak":"Diamond 2",
                    "longBlurb": "Premade teams can sign up with a maximum of 10 players and must go through a play-ins process to make it into the league. No role restrictions, try whatever new and wacky strat you can come up with to win.",
                    "blurb": "Get a roster of at least 5 players together and compete against other teams in Dominate Premade. Up to 10 players can be on a single team."
                }
            ]
        },
        "divine": {
            "prettyName": "Divine League",
            "ranks": "Diamond",
            "peak": "Diamond 1",
            "img": "dominate.png",
            "blurb": "Competitive, high-stakes 5v5 action for players in the Diamond skill range",
            "longBlurb": "This is a new league aimed at players who have previously participated in Dominate Premade or an equivalent skill level league but are looking for higher stake matches. Capped at Dimaond 1 Divine League has a pay-in fee as well as an increased prize pool suitable for high-elo teams looking to prove their mettle.",
            "subLeagues": [
                {
                    "prettyName": "Divine Premade",
                    "ranks":"Platinum - Diamond 1",
                    "peak":"Diamond 1",
                    "longBlurb": "Premade teams sign-up and are required to pay an entry fee to play. This fee goes towards the prize pool that is distrubuted to the winning teams at the end of the season.",
                    "blurb": "Get a roster of at least 5 players together and compete against other teams in Divine Premade. Up to 10 players can be on a single team."
                }
            ]
        },
        "champions": {
            "prettyName": "Champions League - Scouting Grounds Circuit",
            "ranks": "Master and above",
            "peak": "Challenger (No rank cap)",
            "img": "champions.png",
            "blurb": "Competitive, high-stakes action for players in the Master and above skill range",
            "longBlurb": "Champions League is the best of what we have to offer. This is our most prestigious event, and features some of the best teams outside of professional League of Legends.",
            "subLeagues": [
                {
                    "prettyName": "Champions League",
                    "ranks":"Master and above",
                    "peak":"Uncapped",
                    "longBlurb": "",
                    "blurb": "Teams are accepted into Champions League via a vetting process by Risen administration. Even though we do accept applications for this league, Champions League is entry by invitation only. Teams with a history of success and a genuine commitment to competitive integrity are more likely to be accepted. That being said, don't be discouraged from filling out an application if you think your team has got what it takes to compete with some of the best players outside of professional League of Legends. If we think your team looks competitive, we'll be sure to reach out. For any additional information, please reach out to any of the Risen Admin team and we can point you in the right direction."
                }
            ]
        }
    }
}
