{
    "home": {
        "whoAreWe": "Risen Esports is a League of Legends tournament organizer bringing an authentic competitive experience to amateur players of all skill levels. Founded in March 2017, Risen is one of the longest-operating tournament organizers in North America, serving over 10,000 competitors, including at the top amateur level in partnership with Riot Games for the NA LCS Proving Grounds. Community-focused and driven, Risen continues to offer eight total leagues for players from silver to challenger, allowing participants to sign up solo or as part of a team.",
        "leagueData": "The best way to keep up to date with Risen is by joining our Discord! All announcements, community events, and staff can be found there.",
        "goodies": "Risen has plenty to offer beyond just League of Legends competition. With a Discord community of 6000+, frequent community events that branch out into other game titles, ties to some of the best production & casting in NA, there's plenty to check out. If you want to take the competition even more seriously, we have a stats paged powered by match data, allowing you to delve into and analyze your results in Risen play, seeing how you compare to your competitors."
    },
    "contact": {
        "blurb": "Our staff team has a wide range of backgrounds & experiences, allowing us to best serve our community. If you need to reach us, you can join our Discord server or add us directly!",
        "people": [
            {
                "title": "Founder & President",
                "name": "Travis Guyer",
                "responsibilities": "business inquiries, technical inquiries, partnerships",
                "email": "Risenbusiness@gmail.com",
                "discord": "RSN Travis#6119"
            },
            {
                "title": "Community Manager & Operations Lead",
                "name": "Cole \"Coleslaw\" Bowden",
                "responsibilities": "feedback, complaints, tournament formatting and scheduling",
                "email": "Risenbusiness@gmail.com",
                "discord": "Cole#0004"
            },
            {
                "title": "Broadcast Manager",
                "name": "hpika",
                "responsibilities": "stream/broadcast inquiries, casting inquiries",
                "email": "Risenbusiness@gmail.com",
                "discord": "hpika#9424"
            },
            {
                "title": "Head of Divine & Champions Leagues",
                "name": "DemoZ",
                "responsibilities": "inquiries regarding our top-level, paid leagues",
                "email": "Risenbusiness@gmail.com",
                "discord": "DemoZ#7989"
            },
            {
                "title": "Head of Roster Management",
                "name": "Tyrell",
                "responsibilities": "roster issues, player behavior issues, general questions",
                "email": "Risenbusiness@gmail.com",
                "discord": "Tyrell#0205"
            },
            {
                "title": "Roster Management",
                "name": "Soulbert",
                "responsibilities": "roster issues, player behavior issues, general questions",
                "email": "Risenbusiness@gmail.com",
                "discord": "Soulbert#7829"
            },
            {
                "title": "Roster Management",
                "name": "Hedge",
                "responsibilities": "roster issues, player behavior issues, general questions",
                "email": "Risenbusiness@gmail.com",
                "discord": "Hedge#4737"
            },
            {
                "title": "Website and Technical",
                "name": "Earleking",
                "responsibilities": "website, stats, technical issues, general questions",
                "email": "Risenbusiness@gmail.com",
                "discord": "Earleking#0204"
            }
        ]
    },
    "leagues": {
        "champions": {
            "prettyName": "Champions League",
            "ranks": "Master+",
            "peak": "None",
            "img": "RE_TypeLogo_Shading.png",
            "blurb": "Competitive, high-stakes action for the best amateur players in North America.",
            "longBlurb": "Champions League is the best of what we have to offer. With the highest entry fees and highest prize pools, it is your opportunity to compete against the best that NA Amateur has to offer.",
            "subLeagues": [
                {
                    "prettyName": "Champions League",
                    "ranks":"Master+",
                    "cost": "Paid",
                    "size": "5-10 Players",
                    "peak":"None",
                    "longBlurb": "Champions League takes place 2-3 times annually. Specific dates, announcements, and information can be found on the Discord.",
                    "blurb": "Risen only accepts the top signups for Champions League as determined by average rank basis. If necessary, Risen will run a no-cost playin to determine what teams will be competing."
                }
            ]
        },
        "divine": {
            "prettyName": "Divine League",
            "ranks": "Diamond",
            "peak": "Masters",
            "img": "dominate.png",
            "blurb": "Competitive, high-stakes 5v5 action for players in the Diamond-Master skill range",
            "longBlurb": "Divine is a step below the top level of competition, serving as a great option for collegiate teams and players looking for a stepping stone into highest-level competition.",
            "subLeagues": [
                {
                    "prettyName": "Divine",
                    "ranks":"Diamond - Master",
                    "cost": "Paid",
                    "size": "5-10 Players",
                    "peak":"Masters",
                    "longBlurb": "Full teams sign-up and are required to pay an entry fee to play. This fee goes towards the prize pool that is distrubuted to the winning teams at the end of the season.",
                    "blurb": "Get a roster of at least 5 players together and compete against other teams in Divine Premade. Up to 10 players can be on a single team."
                }
            ]
        },
        "dominate": {
            "prettyName": "Dominate Leagues",
            "ranks": "Platinum - Diamond",
            "peak": "Diamond 1",
            "img": "dominate.png",
            "blurb": "Competitive 5v5 action for players in the Platinum - Diamond skill range.",
            "longBlurb": "Dominate is our league for players in the Platiunum/Diamond skill range.\n\n Whether you’re an open or premade player, you’ll get to interact with an awesome and very active community, and improve alongside your teammates. It's a great way to step into competitive play and get comfortable with organized, 5v5 competition.",
            "subLeagues": [
                {
                    "prettyName": "Premade Dominate",
                    "ranks":"Platinum - Diamond",
                    "peak":"Diamond 1",
                    "size": "5-10 Players",
                    "cost": "Varies",
                    "longBlurb": "Premade teams can sign up with a maximum of 10 players and must go through a play-ins process to make it into the league. No role restrictions. Entry fee varies based on participating team interest - join the Discord for more info.",
                    "blurb": "Get a roster of at least 5 players together and compete against other teams in Dominate Premade. Up to 10 players can be on a single team."
                },
                {
                    "prettyName": "Open Dominate",
                    "ranks":"Platinum - Diamond",
                    "peak":"Diamond 1",
                    "size": "Solo",
                    "cost": "Free",
                    "longBlurb": "Open league players sign up solo. The rest of your team is assigned to you by our Roster staff.",
                    "blurb": "Sign up on your own and compete with a new, rank-balanced team!"
                }
            ]
        },
        "unstoppable": {
            "prettyName": "Unstoppable League",
            "ranks": "Gold - Platinum",
            "peak": "Platinum 1",
            "img": "rampage.png",
            "blurb": "Competitive 5v5 action for players in the Gold - Platinum skill range.",
            "longBlurb": "Unstoppable is our most popular rank bracket, serving players who want a taste of competitive without being beholden to top-level meta or entry fees.",
            "subLeagues": [
                {
                    "prettyName": "Unstoppable Premade",
                    "ranks":"Gold - Platinum",
                    "cost": "Free",
                    "size": "5-10 Players",
                    "peak":"Platinum 1",
                    "longBlurb": "Premade teams can sign up with a maximum of 10 players and must go through a play-ins process to make it into the league. No role restrictions, try whatever new and wacky strat you can come up with to win.",
                    "blurb": "Get a roster of at least 5 players together and compete against other teams in Unstoppable Premade. Up to 10 players can be on a single team."
                },
                {
                    "prettyName": "Open Unstoppable",
                    "ranks":"Gold - Platinum",
                    "peak":"Platinum 1",
                    "size": "Solo",
                    "cost": "Free",
                    "longBlurb": "Open league players sign up solo. The rest of your team is assigned to you by our Roster staff.",
                    "blurb": "Sign up on your own and compete with a new, rank-balanced team!"
                }
            ]
        },
        "rampage": {
            "prettyName": "Rampage Leagues",
            "ranks": "Silver - Gold",
            "peak": "Gold 1",
            "img": "rampage.png",
            "blurb": "Competitive 5v5 action for players in the Gold/Silver skill range",
            "longBlurb": "Rampage is our league for players in the Silver/Gold skill range. \n\n Many of Risen's top players and admins got their start at this level, working their way up from here! Playing in one of these leagues can be a great catalyst for improvement in League of Legends!",
            "subLeagues": [
                {
                    "prettyName": "Premade Rampage",
                    "ranks":"Silver - Gold",
                    "cost": "Free",
                    "size": "5-10 Players",
                    "peak":"Gold 1",
                    "longBlurb": "Premade teams can sign up with a maximum of 10 players and must go through a play-ins process to make it into the league. No role restrictions, try whatever new and wacky strategies you can come up with to win!",
                    "blurb": "Get a roster of at least 5 players together and compete against other teams in Rampage Premade. Up to 10 players can be on a single team."
                },
                {
                    "prettyName": "Open Rampage",
                    "ranks":"Silver - Gold",
                    "cost": "Free",
                    "size": "Solo",
                    "peak":"Gold 1",
                    "longBlurb": "Open league players sign up solo. The rest of your team is assigned to you by our Roster staff.",
                    "blurb": "Sign up on your own and compete with a new, rank-balanced team!"
                }
            ]
        }
    }
}
